{
  "frozen-seafood-in-clam-sauce": {
    "ingredients": [
      "2 1/4 lbs frozen seafood in clams",
      "2 tablespoons alfredo sauce",
      "30 g shortening, melted",
      "1 red capsicum, thinly sliced",
      "1 can chopped clams"
    ],
    "instructions": [
      "Thaw the seafood under cold water by wrapping in cheesecloth, placing on a paper towel in between applications",
      "Place the seafood in a freezer bag and press out excess air",
      "In a saucepan over low heat, combine the sauce ingredients",
      "Bring to boil",
      "Pour over your seafood in the freezer bag and seal, placing the top one corner facing out",
      "Freeze seafood according to the manufacturer's instructions",
      "Remove the seafood from the freezer, drain of any oil and discard the clams",
      "Place a heat proof paper covered frying pan over the stove and cook the seafood for 6 8 minutes, until the meat turns opaque"
    ],
    "rating": 1,
    "title": "Frozen Seafood in Clam Sauce",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/SeaFoodCalmSauce.jpg",
    "gist": "Indulge in a rich and savory seafood delight with tender clams and a creamy sauce, perfect for a luxurious dinner."
  },
  "french-revolution-bread": {
    "ingredients": [
      "butter or margarine",
      "1/4 bulb, roasted sliced bell pepper, cut into thin strips and kept separate",
      "4 large firm ripe bananas, sliced",
      "1 red grapes or 1 golden seedless grapes, halved lengthwise",
      "1 cup gruyere or 1 cup swiss cheese"
    ],
    "instructions": [
      "Brush a 13 x 9 x 2 inch glass baking dish with melted butter or margarine",
      "Spread roasted bell pepper strips over the bottom of the dish in a spiral",
      "Arrange the sliced bananas over the peppers",
      "Scatter the gruyere over the bananas",
      "Spread grape seeds over the cheese",
      "Cover with plastic wrap and refrigerate for 8 24 hours",
      "Let stand at room temperature for 30 45 minutes before serving"
    ],
    "rating": 1,
    "title": "French Revolution Bread",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/FrenchRevBread.jpg",
    "gist": "A unique blend of roasted peppers, bananas, and cheese, this bread is a revolutionary twist on traditional flavors."
  },
  "pasta-with-fettuccine": {
    "ingredients": [
      "1 lb fettuccine ( medium pasta shape )",
      "1 tablespoon chopped mint leaf",
      "1 tablespoon chopped celery leaves",
      "1 tablespoon chopped fresh mint leaves",
      "2 tablespoons vanilla",
      "1 tablespoon ground cardamom"
    ],
    "instructions": [
      "Cook pasta according to package directions",
      "When pasta is tender, drain and set aside",
      "In a food processor or blender, combine mint, celery leaves, and vanilla and process until smooth",
      "Add to pasta and toss to coat",
      "Serve immediately or cover and refrigerate for up to two days"
    ],
    "rating": 1,
    "title": "Pasta With Fettuccine",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/PastaWIthFattucino.jpg",
    "gist": "A refreshing pasta dish infused with mint and cardamom, offering a burst of flavor in every bite."
  },
  "strawberry-salad": {
    "ingredients": [
      "6 cups iceberg lettuce, chopped ( any of your favorite )",
      "1 package frozen mixed vegetables ( like potato sticks or peas )",
      "1 cup monterey jack pepper cheese, shredded",
      "3 cups crushed strawberries",
      "1/2 teaspoon turmeric"
    ],
    "instructions": ["Boil 6 cups water", "Add 2 tbsp salt&#241"],
    "rating": 1,
    "title": "Strawberry Salad",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/StrawberrySalad.jpg",
    "gist": "A vibrant salad combining sweet strawberries and crisp lettuce, topped with a hint of turmeric for a unique twist."
  },
  "homemade-feta": {
    "ingredients": [
      "1/4 cup of finely chopped onion",
      "3 garlic cloves, chopped or pressed ( for garlic lovers )",
      "salt"
    ],
    "instructions": [
      "Combine all ingredients in a small saucepan and cover with a lid",
      "Cook over medium heat just until heated through, about 15 minutes",
      "Note, use about half the amount of feta you are planning on using",
      "Some have even used other feta cheese"
    ],
    "rating": 1,
    "title": "Homemade Feta",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/HomemadeFetaCheeze.jpg",
    "gist": "Craft your own creamy and tangy feta cheese at home with simple ingredients and a burst of garlic flavor."
  },
  "lekvar": {
    "ingredients": [
      "8 ounces miso ( soybean paste )",
      "3 large eggs",
      "2 tablespoons minced garlic",
      "1 lb leeksvar greens or 1 lb spinach"
    ],
    "instructions": [
      "Put together chopped garlic, miso and spinach",
      "Cook in microwave for 1/2 minute",
      "Let cool and then put into refigerator to chill",
      "Serve cold or room temperature"
    ],
    "rating": 1,
    "title": "Lekvar",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/Lekvar.jpg",
    "gist": "A savory blend of miso, garlic, and greens, perfect as a chilled spread or dip for any occasion."
  },
  "truffled-eggs": {
    "ingredients": [
      "4 eggs",
      "3/4 cup miso",
      "1 tablespoon minced garlic",
      "1 tablespoon chopped truffles"
    ],
    "instructions": [
      "Place eggs in a saucepan and cover with water",
      "Bring water to a boil and immediately remove from heat",
      "Cover eggs with cold water",
      "Place pan over high heat until water is very bubbly, then remove from heat and allow to cool to room temperature",
      "Carefully crack eggs and place in a bowl of cold water to harden",
      "Chop the eggs coarsely and transfer to a non metallic bowl",
      "Stir in miso, garlic, truffle, and salt"
    ],
    "rating": 1,
    "title": "Truffled Eggs",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/TruffledEggs.jpg",
    "gist": "Elevate your breakfast with these luxurious truffled eggs, infused with the rich flavors of miso and garlic."
  },
  "alfredo-sauce": {
    "ingredients": ["1 egg", "1/2 cup granulated sugar", "1 clove garlic"],
    "instructions": [
      "Put the egg and half the sugar in a blender",
      "Bloom on high till mixture is light and frothy",
      "Add the garlic a little at a time and blend till fine",
      "When ready to use stir in remaining sugar",
      "Enjoy"
    ],
    "rating": 1,
    "title": "Alfredo Sauce",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/AlfredoSauce.jpeg",

    "gist": "A creamy and sweet Alfredo sauce with a hint of garlic, perfect for drizzling over your favorite dishes."
  },
  "garlic-crust-eggs": {
    "ingredients": ["5 eggs", "2 cups sugar", "2 teaspoons garlic, minced"],
    "instructions": [
      "Preheat oven to 325 degrees",
      "Break eggs into a large bowl and blend well",
      "Add sugar, garlic and garlic and mix to combine completely",
      "Add salt to taste",
      "Add about a teaspoon full of oil or melted margarine to fry pan",
      "If the mixture is too dry, add a bit of milk",
      "Heat pan until it gets dry, then reduce heat to low",
      "Add egg mixture and mix well while its bubbling",
      "You can also scramble the eggs by dropping them into a colander at the last minute then they can be turned and fried until golden brown, but less likely to over cook the whites as they cook in the oven",
      "Drain on paper towels and serve"
    ],
    "rating": 1,
    "title": "Garlic Crust Eggs",
    "image": "http://gkdey17cse.github.io/RatatouilleImages/GarlicCrustEggs.jpg",
    "gist": "A unique egg dish with a sweet and garlicky crust, offering a delightful contrast of flavors in every bite."
  },
  "sea-scallops": {
    "ingredients": ["sea scallops", "sea scallops, for dunking"],
    "instructions": [
      "The easiest way to prepare sea scallop is to slice through it on the top but not cutting right through",
      "This is much easier if you do this",
      "If not cutting through it you can use scissors or the cut side of the scallops",
      "This works better than cutting the scallops in half horizontally as you will have the scallops standing up in a flat surface",
      "This will result in good scallop shape",
      "When you are ready to eat, dunk them into a bowl of salted boiling water and immediately plunge as many as you are ready for into the salted water",
      "They will sink to the bottom, so make sure they are thoroughly prepared",
      "You can also steam them in the same pan you cooked them inches",
      "They will be ready when they curl back around in the center",
      "Drain well and then serve warm or cold"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/SeaScallops.jpg",
    "title": "Sea Scallops",
    "gist": "Perfectly prepared sea scallops, tender and flavorful, ideal for a gourmet seafood experience."
  },
  "salsa-verde-(salsa-verde)": {
    "ingredients": ["2 red capsicums, halved and deseeded", "1 onion, sliced"],
    "instructions": [
      "Place all the ingredients into a slow cooker",
      "If using a crockpot, heat for 15 60 minutes on high, stirring once halfway through cooking time to ensure the mixture doesn't dry out",
      "When cooked serve immediately",
      "Alternatively keep in a bowl in the fridge and use as is"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/SalsaVerde.jpg",
    "title": "Salsa Verde (Salsa Verde)",
    "gist": "A zesty and vibrant salsa verde, perfect for adding a fresh and tangy touch to any dish."
  },
  "crab-with-cream-for-one": {
    "ingredients": ["1 1/2 lbs crabmeat", "2 cups butter or 2 cups margarine"],
    "instructions": [
      "Cut or tear crabmeat into small pieces",
      "Melt butter in a large sauté pan over medium heat",
      "Fry crab meat until golden brown"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/CrabWithCreamforOne.jpg",
    "title": "Crab With Cream for One",
    "gist": "A decadent crab dish, rich with butter and cream, perfect for a luxurious solo dining experience."
  },
  "cheese-mixture": {
    "ingredients": ["6 large eggs", "200 ml milk", "3 eggs, separated"],
    "instructions": [
      "Beat together the 5 eggs and the milk with a little salt",
      "Stir in a teaspoon of salt",
      "Beat the egg whites until they are stiff and fold them into the mixture",
      "Put mixture into a buttered 20 x 30 cm pan and bake at 180º c for 45 minutes, or until golden brown",
      "Serve hot with slices of toast, buttered cabbage or potatoes and lettuce"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/CheeseMixture.jpg",
    "title": "Cheese Mixture",
    "gist": "A fluffy and cheesy baked delight, perfect for breakfast or as a side dish with your favorite greens."
  },
  "mixed-vegetables": {
    "ingredients": [
      "3/4 cup millet",
      "1 onion, finely chopped",
      "2 green chilies, finely chopped",
      "2 teaspoons coconut, grated",
      "1/2 teaspoon poppy seed",
      "1/2 teaspoon salt",
      "1 1/4 cups shredded coconut"
    ],
    "instructions": [
      "Soak millet in sufficient water for about 1 hour",
      "Drain well and mash with a potato masher",
      "Heat a small sauté pan, pour in half the milled millet",
      "Stir fry for 1 minute, then stir in the chopped onion and green chillies",
      "Sauté for 5 minutes or till the onion has turned lightly brown",
      "Stir in the remaining millet",
      "Stir the ground coconut, poppy seeds and salt",
      "Stir well, then add the shredded coconut",
      "Serve hot with chapatis or raita"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/MixedVegetables.jpg",
    "title": "Mixed Vegetables",
    "gist": "A hearty mix of millet, coconut, and spices, this dish is a flavorful vegetarian treat best enjoyed with chapatis or raita."
  },
  "sweet-onion-salad-dressing": {
    "ingredients": [
      "2 large sweet onions, thinly sliced and cut into half-inch pieces or 2 large red onions, cut into half-inch pieces",
      "1 teaspoon salt",
      "3/4 cup sugar ( or to taste )"
    ],
    "instructions": [
      "Combine all ingredients in a serving bowl, stirring as it sits while you prepare the rest of the ingredients",
      "Cover and set aside at room temperature for at least 30 minutes to allow flavors to develop"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/SweetOnionSaladDressing.jpg",
    "title": "Sweet Onion Salad Dressing",
    "gist": "A sweet and tangy onion dressing that adds a burst of flavor to any salad, ready in just 30 minutes!"
  },
  "simple-carrot-halwa": {
    "ingredients": [
      "1 lb carrot, peeled and cut into long thin matchsticks",
      "2 tablespoons ghee ( clarified butter )",
      "1 pinch salt",
      "1/2 teaspoon sugar"
    ],
    "instructions": [
      "Steam the carrot over med low heat until tender crisp, about 5 minutes",
      "Cool and then puree in an electric blender",
      "Set aside",
      "Heat oil over medium high heat",
      "When pan is hot, add carrot puree and cook until the pan gets very dark and starts getting hard",
      "This may take 20 minutes or more if the mixture is very thin",
      "Stir the carrot often until it is quite dark",
      "Stir in salt and sugar",
      "Continue to stir until the halwa turns golden brown"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/SimpleCarrotHalwa.jpg",
    "title": "Simple Carrot Halwa",
    "gist": "A classic Indian dessert made with grated carrots, ghee, and sugar, offering a rich and indulgent treat."
  },
  "carrot-ghee-raita-(indian-carrot-ghee-raita)": {
    "ingredients": [
      "2 tablespoons carrot, grated",
      "1 tablespoon milk",
      "2 tablespoons ghee"
    ],
    "instructions": [
      "In a saucepan, heat milk to boiling point",
      "Stir in the grated carrots, stir until the carrots have dissolved",
      "Add the milk, stirring continuously, to avoid lumps",
      "Cook until the mixture thickens",
      "Stir in the ghee and serve immediately"
    ],
    "rating": 1,
    "image": "http://gkdey17cse.github.io/RatatouilleImages/IndianCarrotGheeRaita.jpg",
    "title": "Indian Carrot-Ghee Raita",
    "gist": "A creamy and aromatic raita made with grated carrots and ghee, perfect as a refreshing side dish for any Indian meal."
  }
}
